ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405xx/at32f402_405xx.h
/** @addtogroup Exported_types
  * @{
  */  

typedef int32_t  INT32;
typedef int16_t  INT16;
typedef int8_t   INT8;
typedef uint32_t UINT32;
typedef uint16_t UINT16;
typedef uint8_t  UINT8;

typedef int32_t  s32;
typedef int16_t  s16;
typedef int8_t   s8;

typedef const int32_t sc32;   /*!< read only */
typedef const int16_t sc16;   /*!< read only */
typedef const int8_t  sc8;    /*!< read only */

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef __I int32_t vsc32;    /*!< read only */
typedef __I int16_t vsc16;    /*!< read only */
typedef __I int8_t  vsc8;     /*!< read only */

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;  /*!< read only */
typedef const uint16_t uc16;  /*!< read only */
typedef const uint8_t  uc8;   /*!< read only */

typedef __IO uint32_t vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;   /*!< read only */
typedef __I uint16_t vuc16;   /*!< read only */
typedef __I uint8_t  vuc8;    /*!< read only */

typedef enum {RESET = 0, SET = !RESET} flag_status;
typedef enum {ERROR = 0, SUCCESS = !ERROR} error_status;

/**
  * @}
  */

/** @addtogroup Exported_macro
  * @{
  */

#define REG8(addr)                       *(volatile uint8_t *)(addr)
#define REG16(addr)                      *(volatile uint16_t *)(addr)
#define REG32(addr)                      *(volatile uint32_t *)(addr)

#define MAKE_VALUE(reg_offset, bit_num)  (((reg_offset) << 16) | (bit_num & 0x1f))

#define PERIPH_REG(periph_base, value)   REG32((periph_base + (value >> 16)))
#define PERIPH_REG_BIT(value)            (0x1u << (value & 0x1f))

/**
  * @}
  */



  

/** @addtogroup Peripheral_registers_structures
  * @{
  */

/* ================================================================================ */
/* ================                       ACC                      ================ */
/* ================================================================================ */


/**
  * @brief HSI Auto Clock Calibration (ACC)
  */

typedef struct
{                                                   /*!< ACC Structure                                                         */
  __IO uint32_t  STS;                               /*!< status register                                                       */
  __IO uint32_t  CTRL1;                             /*!< control register 1                                                    */
  __IO uint32_t  CTRL2;                             /*!< control register 2                                                    */
  __IO uint32_t  CC1;                               /*!< compare value 1                                                       */
  __IO uint32_t  CC2;                               /*!< compare value 2                                                       */
  __IO uint32_t  CC3;                               /*!< compare value 3                                                       */
} ACC_TypeDef;


/* ================================================================================ */
/* ================                      ADC                       ================ */
/* ================================================================================ */


/**
  * @brief Analog to digital converter (ADC)
  */

typedef struct
{                                                   /*!< ADC Structure                                                         */
  __IO uint32_t  STS;                               /*!< status register                                                       */
  __IO uint32_t  CTRL1;                             /*!< control register 1                                                    */
  __IO uint32_t  CTRL2;                             /*!< control register 2                                                    */
  __IO uint32_t  SPT1;                              /*!< sample time register 1                                                */
  __IO uint32_t  SPT2;                              /*!< sample time register 2                                                */
  __IO uint32_t  PCDTO1;                            /*!< Preempted channel 1 data offset register                              */
  __IO uint32_t  PCDTO2;                            /*!< Preempted channel 2 data offset register                              */
  __IO uint32_t  PCDTO3;                            /*!< Preempted channel 3 data offset register                              */
  __IO uint32_t  PCDTO4;                            /*!< Preempted channel 4 data offset register                              */
  __IO uint32_t  VMHB;                              /*!< Voltage monitoring high boundary register                             */
  __IO uint32_t  VMLB;                              /*!< Voltage monitoring low boundary register                              */
  __IO uint32_t  OSQ1;                              /*!< Ordinary sequence register 1                                          */
  __IO uint32_t  OSQ2;                              /*!< Ordinary sequence register 2                                          */
  __IO uint32_t  OSQ3;                              /*!< Ordinary sequence register 3                                          */
  __IO uint32_t  PSQ;                               /*!< Preempted sequence register                                           */
  __IO uint32_t  PDT1;                              /*!< Preempted data register 1                                             */
  __IO uint32_t  PDT2;                              /*!< Preempted data register 2                                             */
  __IO uint32_t  PDT3;                              /*!< Preempted data register 3                                             */
  __IO uint32_t  PDT4;                              /*!< Preempted data register 4                                             */
  __IO uint32_t  ODT;                               /*!< Ordinary data register                                                */
  __IO uint32_t  RESERVED0[12];
  __IO uint32_t  OVSP;                              /*!< oversampling register                                                 */
} ADC_TypeDef;


/* ================================================================================ */
/* ================                     ADCCOM                     ================ */
/* ================================================================================ */


/**
  * @brief ADC common area (ADCCOM)
  */

typedef struct
{                                                   /*!< ADCCOM Structure                                                      */
  __IO uint32_t  RESERVED0;
  __IO uint32_t  CCTRL;                             /*!< Common control register                                               */
} ADCCOM_TypeDef;


/* ================================================================================ */
/* ================                      CAN                       ================ */
/* ================================================================================ */


/**
  * @brief Controller Area Network (CAN)
  */
/**
  * @brief Controller Area Network TX Mailbox Registers
  */

typedef struct
{
  __IO uint32_t  TMI;                               /*!< Transmit mailbox identifier register                                  */
  __IO uint32_t  TMC;                               /*!< Transmit mailbox data length and time stamp register                  */
  __IO uint32_t  TMDTL;                             /*!< Transmit mailbox low byte data register                               */
  __IO uint32_t  TMDTH;                             /*!< Transmit mailbox high byte data register                              */
} CAN_TxMailBox_TypeDef;

/**
  * @brief Controller Area Network FIFO Mailbox Registers
  */

typedef struct
{
  __IO uint32_t  RFI;                               /*!< Receive FIFO register                                                 */
  __IO uint32_t  RFC;                               /*!< Receive FIFO data length and time stamp register                      */
  __IO uint32_t  RFDTL;                             /*!< Receive FIFO low byte data register                                   */
  __IO uint32_t  RFDTH;                             /*!< Receive FIFO high byte data register                                  */
} CAN_FIFOMailBox_TypeDef;

/**
  * @brief Controller Area Network Filter Registers
  */

typedef struct
{
  __IO uint32_t  FFB1;                              /*!< Filter bank filtrate bit register 1                                   */
  __IO uint32_t  FFB2;                              /*!< Filter bank filtrate bit register 2                                   */
} CAN_FilterRegister_TypeDef;

/**
  * @brief Controller Area Network
  */

typedef struct
{                                                   /*!< CAN Structure                                                         */
  __IO uint32_t  MCTRL;                             /*!< Main control register                                                 */
  __IO uint32_t  MSTS;                              /*!< Main status register                                                  */
  __IO uint32_t  TSTS;                              /*!< Transmit status register                                              */
  __IO uint32_t  RF0;                               /*!< Receive FIFO 0 register                                               */
  __IO uint32_t  RF1;                               /*!< Receive FIFO 1 register                                               */
  __IO uint32_t  INTEN;                             /*!< Interrupt enable register                                             */
  __IO uint32_t  ESTS;                              /*!< Error status register                                                 */
  __IO uint32_t  BTMG;                              /*!< Bit timing register                                                   */
  __IO uint32_t  RESERVED0[88];
  CAN_TxMailBox_TypeDef  sTxMailBox[3];             /*!< Transmit mailbox registers                                            */
  CAN_FIFOMailBox_TypeDef  sFIFOMailBox[2];         /*!< Receive FIFO registers                                                */
  __IO uint32_t  RESERVED1[12];
  __IO uint32_t  FCTRL;                              /*!< Filter control register                                              */
  __IO uint32_t  FMCFG;                              /*!< Filter mode config register                                          */
  __IO uint32_t  RESERVED2;
  __IO uint32_t  FBWCFG;                             /*!< Filter bit width config register                                     */
  __IO uint32_t  RESERVED3;
  __IO uint32_t  FRF;                                /*!< Filter related FIFO register                                         */
  __IO uint32_t  RESERVED4;
  __IO uint32_t  FACFG;                              /*!< Filter activate configuration register                               */
  __IO uint32_t  RESERVED5[8];
  CAN_FilterRegister_TypeDef  sFilterRegister[14];   /*!< Filter registers                                                     */
} CAN_TypeDef;


/* ================================================================================ */
/* ================                       CRC                      ================ */
/* ================================================================================ */


/**
  * @brief CRC calculation unit (CRC)
  */

typedef struct
{                                                   /*!< CRC Structure                                                         */
  __IO uint32_t  DT;                                /*!< Data register                                                         */
  __IO uint32_t  CDT;                               /*!< Common data register                                                  */
  __IO uint32_t  CTRL;                              /*!< Control register                                                      */
  __IO uint32_t  RESERVED0;
  __IO uint32_t  IDT;                               /*!< Initial data register                                                 */
  __IO uint32_t  POLY;                              /*!< Polynomial coefficient register                                       */
} CRC_TypeDef;


/* ================================================================================ */
/* ================                       CRM                      ================ */
/* ================================================================================ */


/**
  * @brief Clock and reset management (CRM)
  */

typedef struct
{                                                   /*!< CRM Structure                                                         */
  __IO uint32_t  CTRL;                              /*!< Clock control register                                                */
  __IO uint32_t  PLLCFG;                            /*!< PLL configuration register (CRM_PLLCFG)                               */
  __IO uint32_t  CFG;                               /*!< Clock configuration register(CRM_CFG)                                 */
  __IO uint32_t  CLKINT;                            /*!< Clock interrupt register (CRM_CLKINT)                                 */
  __IO uint32_t  AHBRST1;                           /*!< AHB peripheral reset register1 (CRM_AHBRST1)                          */
  __IO uint32_t  AHBRST2;                           /*!< AHB peripheral reset register 2 (CRM_AHBRST2)                         */
  __IO uint32_t  AHBRST3;                           /*!< AHB peripheral reset register 3 (CRM_AHBRST3)                         */
  __IO uint32_t  RESERVED0;
  __IO uint32_t  APB1RST;                           /*!< APB1 peripheral reset register (CRM_APB1RST)                          */
  __IO uint32_t  APB2RST;                           /*!< APB2 peripheral reset register (CRM_APB2RST)                          */
  __IO uint32_t  RESERVED1[2];
  __IO uint32_t  AHBEN1;                            /*!< AHB Peripheral Clock enable register 1 (CRM_AHBEN1)                   */
  __IO uint32_t  AHBEN2;                            /*!< AHB peripheral clock enable register 2 (CRM_AHBEN2)                   */
  __IO uint32_t  AHBEN3;                            /*!< AHB peripheral clock enable register 3 (CRM_AHBEN3)                   */
  __IO uint32_t  RESERVED2;
  __IO uint32_t  APB1EN;                            /*!< APB1 peripheral clock enable register (CRM_APB1EN)                    */
  __IO uint32_t  APB2EN;                            /*!< APB2 peripheral clock enable register (CRM_APB2EN)                    */
  __IO uint32_t  RESERVED3[2];
  __IO uint32_t  AHBLPEN1;                          /*!< AHB Low-power Peripheral Clock enable register 1 (CRM_AHBLPEN1)       */
  __IO uint32_t  AHBLPEN2;                          /*!< AHB peripheral Low-power clock enable register 2 (CRM_AHBLPEN2)       */
  __IO uint32_t  AHBLPEN3;                          /*!< AHB peripheral Low-power clock enable register 3 (CRM_AHBLPEN3)       */
  __IO uint32_t  RESERVED4;
  __IO uint32_t  APB1LPEN;                          /*!< APB1 peripheral Low-power clock enable register (CRM_APB1LPEN)        */
  __IO uint32_t  APB2LPEN;                          /*!< APB2 peripheral Low-power clock enable register (CRM_APB2LPEN)        */
  __IO uint32_t  RESERVED5[2];
  __IO uint32_t  BPDC;                              /*!< Battery powered domain control register (CRM_BPDC)                    */
  __IO uint32_t  CTRLSTS;                           /*!< Control/status register (CRM_CTRLSTS)                                 */
  __IO uint32_t  OTGHS;                             /*!< OTGHS register                                                        */
  __IO uint32_t  RESERVED6[9];
  __IO uint32_t  MISC1;                             /*!< Miscellaneous register1                                               */
  __IO uint32_t  MISC2;                             /*!< Miscellaneous register2                                               */
} CRM_TypeDef;


/* ================================================================================ */
/* ================                      DEBUG                     ================ */
/* ================================================================================ */


/**
  * @brief Debug support (DEBUG)
  */

typedef struct
{                                                   /*!< DEBUG Structure                                                       */
  __IO uint32_t  IDCODE;                            /*!< DEBUG IDCODE                                                          */
  __IO uint32_t  CTRL;                              /*!< DEBUG CTRL                                                            */
  __IO uint32_t  APB1_PAUSE;                        /*!< DEBUG APB1 PAUSE                                                      */
  __IO uint32_t  APB2_PAUSE;                        /*!< DEBUG APB2 PAUSE                                                      */
  __IO uint32_t  RESERVED0[4];
  __IO uint32_t  SER_ID;                            /*!< SERIES ID                                                             */
} DEBUG_TypeDef;


/* ================================================================================ */
/* ================                      DMA                       ================ */
/* ================================================================================ */


/**
  * @brief DMA controller (DMA)
  */

typedef struct
{                                                   /*!< DMA Structure                                                         */
  __IO uint32_t  STS;                               /*!< DMA interrupt status register (DMA_STS)                               */
  __IO uint32_t  CLR;                               /*!< DMA interrupt flag clear register (DMA_CLR)                           */
  __IO uint32_t  RESERVED1[62];
  __IO uint32_t  MUXSEL;                            /*!< DMAMUX Table Selection                                                */
  __IO uint32_t  RESERVED2[11];
  __IO uint32_t  MUXSYNCSTS;                        /*!< Channel Interrupt Status Register                                     */
  __IO uint32_t  MUXSYNCCLR;                        /*!< Channel Interrupt Clear Flag Register                                 */
  __IO uint32_t  MUXGSTS;                           /*!< Generator Interrupt Status Register                                   */
  __IO uint32_t  MUXGCLR;                           /*!< Generator Interrupt Clear Flag Register                               */
} DMA_TypeDef;


/* ================================================================================ */
/* ================                      DMA  Channel              ================ */
/* ================================================================================ */


/**
  * @brief DMA controller Channel(DMA Channel)
  */
typedef struct
{                                                   /*!< DMA Channel Structure                                                 */
  __IO uint32_t  CTRL;                              /*!< DMA channel configuration register                                    */
  __IO uint32_t  DTCNT;                             /*!< DMA channel number of data to transfer register                       */
  __IO uint32_t  PADDR;                             /*!< DMA channel peripheral base address register                          */
  __IO uint32_t  MADDR;                             /*!< DMA channel memory base address register                              */
} DMA_Channel_TypeDef;


/* ================================================================================ */
/* ================                      DMA MUX                   ================ */
/* ================================================================================ */


/**
  * @brief DMA MUX controller
  */
typedef struct
{
  __IO uint32_t  MUXCTRL;                            /*!< Channel Configuration Register                                       */

