ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405xx/at32f402_405xx.h
} DMAMUX_Channel_TypeDef;


/* ================================================================================ */
/* ================                      DMA Generator             ================ */
/* ================================================================================ */


/**
  * @brief DMA MUX Generator Configuration
  */
typedef struct
{
  __IO uint32_t  GCTRL;                             /*!< Generator Configuration Register                                      */

} DMAMUX_Generator_TypeDef;


/* ================================================================================ */
/* ================                      ERTC                      ================ */
/* ================================================================================ */


/**
  * @brief Real-time clock (ERTC)
  */

typedef struct
{                                                   /*!< ERTC Structure                                                        */
  __IO uint32_t  TIME;                              /*!< time register                                                         */
  __IO uint32_t  DATE;                              /*!< date register                                                         */
  __IO uint32_t  CTRL;                              /*!< control register                                                      */
  __IO uint32_t  STS;                               /*!< initialization and status register                                    */
  __IO uint32_t  DIV;                               /*!< Diveder register                                                      */
  __IO uint32_t  WAT;                               /*!< Wakeup timer register                                                 */
  __IO uint32_t  CCAL;                              /*!< Calibration register                                                  */
  __IO uint32_t  ALA;                               /*!< Alarm A register                                                      */
  __IO uint32_t  ALB;                               /*!< Alarm B register                                                      */
  __IO uint32_t  WP;                                /*!< write protection register                                             */
  __IO uint32_t  SBS;                               /*!< sub second register                                                   */
  __IO uint32_t  TADJ;                              /*!< time adjust register                                                  */
  __IO uint32_t  TSTM;                              /*!< time stamp time register                                              */
  __IO uint32_t  TSDT;                              /*!< timestamp date register                                               */
  __IO uint32_t  TSSBS;                             /*!< timestamp sub second register                                         */
  __IO uint32_t  SCAL;                              /*!< calibration register                                                  */
  __IO uint32_t  TAMP;                              /*!< tamper and alternate function configuration register                  */
  __IO uint32_t  ALASBS;                            /*!< alarm A sub second register                                           */
  __IO uint32_t  ALBSBS;                            /*!< alarm B sub second register                                           */
  __IO uint32_t  RESERVED0;
  __IO uint32_t  BPR1;                              /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR2;                              /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR3;                              /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR4;                              /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR5;                              /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR6;                              /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR7;                              /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR8;                              /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR9;                              /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR10;                             /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR11;                             /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR12;                             /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR13;                             /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR14;                             /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR15;                             /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR16;                             /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR17;                             /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR18;                             /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR19;                             /*!< Battery powered domain register                                       */
  __IO uint32_t  BPR20;                             /*!< Battery powered domain register                                       */
} ERTC_TypeDef;


/* ================================================================================ */
/* ================                      EXINT                     ================ */
/* ================================================================================ */


/**
  * @brief External Interrupt/Event Controller
  */

typedef struct
{                                                   /*!< EXINT Structure                                                       */
  __IO uint32_t  INTEN;                             /*!< Interrupt enable register                                             */
  __IO uint32_t  EVTEN;                             /*!< Event enable register                                                 */
  __IO uint32_t  POLCFG1;                           /*!< Rising polarity configuration register                                */
  __IO uint32_t  POLCFG2;                           /*!< Falling polarity configuration register                               */
  __IO uint32_t  SWTRG;                             /*!< Software triggle register                                             */
  __IO uint32_t  INTSTS;                            /*!< Interrupt status register                                             */
} EXINT_TypeDef;


/* ================================================================================ */
/* ================                      FLASH                     ================ */
/* ================================================================================ */


/**
  * @brief Flash memory controler (FLASH)
  */

typedef struct
{                                                   /*!< FLASH Structure                                                       */
  __IO uint32_t  PSR;                               /*!< Performance selection register                                        */
  __IO uint32_t  UNLOCK;                            /*!< Unlock register                                                       */
  __IO uint32_t  USD_UNLOCK;                        /*!< USD unlock register                                                   */
  __IO uint32_t  STS;                               /*!< Status register                                                       */
  __IO uint32_t  CTRL;                              /*!< Control register                                                      */
  __IO uint32_t  ADDR;                              /*!< Address register                                                      */
  __IO uint32_t  RESERVED0;
  __IO uint32_t  USD;                               /*!< User system data register                                             */
  __IO uint32_t  EPPS;                              /*!< Erase/program protection status register                              */
  __IO uint32_t  RESERVED1[20];
  __IO uint32_t  SLIB_STS0;                         /*!< sLib status 0 register                                                */
  __IO uint32_t  SLIB_STS1;                         /*!< sLib status 1 register                                                */
  __IO uint32_t  SLIB_PWD_CLR;                      /*!< SLIB password clear register                                          */
  __IO uint32_t  SLIB_MISC_STS;                     /*!< sLib misc status register                                             */
  __IO uint32_t  CRC_ADDR;                          /*!< Flash CRC data start address register                                 */
  __IO uint32_t  CRC_CTRL;                          /*!< Flash CRC controll register                                           */
  __IO uint32_t  CRC_CHKR;                          /*!< FLASH CRC check result register                                       */
  __IO uint32_t  RESERVED2[52];
  __IO uint32_t  SLIB_SET_PWD;                      /*!< sLib password setting register                                        */
  __IO uint32_t  SLIB_SET_RANGE;                    /*!< Configure sLib range register                                         */
  __IO uint32_t  EM_SLIB_SET;                       /*!< Extension momery slib set register                                    */
  __IO uint32_t  BTM_MODE_SET;                      /*!< Boot memory mode setting register                                     */
  __IO uint32_t  SLIB_UNLOCK;                       /*!< sLib unlock register                                                  */
} FLASH_TypeDef;


/* ================================================================================ */
/* ================                      GPIO                     ================ */
/* ================================================================================ */


/**
  * @brief General purpose I/Os (GPIO)
  */

typedef struct
{                                                   /*!< GPIO Structure                                                       */
  __IO uint32_t  CFGR;                              /*!< GPIO configuration register                                           */
  __IO uint32_t  OMODE;                             /*!< GPIO output mode register                                             */
  __IO uint32_t  ODRVR;                             /*!< GPIO drive capability register                                        */
  __IO uint32_t  PULL;                              /*!< GPIO pull-up/pull-down register                                       */
  __IO uint32_t  IDT;                               /*!< GPIO input data register                                              */
  __IO uint32_t  ODT;                               /*!< GPIO output data register                                             */
  __IO uint32_t  SCR;                               /*!< Port bit set/clear register                                           */
  __IO uint32_t  WPR;                               /*!< Port write protect register                                           */
  __IO uint32_t  MUXL;                              /*!< GPIO muxing function low register                                     */
  __IO uint32_t  MUXH;                              /*!< GPIO muxing function high register                                    */
  __IO uint32_t  CLR;                               /*!< GPIO bit reset register                                               */
  __IO uint32_t  TOGR;                              /*!< GPIO bit toggle register                                              */
  __IO uint32_t  RESERVED0[3];
  __IO uint32_t  HDRV;                              /*!< Huge current driver                                                   */
  __IO uint32_t  SRCTR;
} GPIO_TypeDef;


/* ================================================================================ */
/* ================                      I2C                       ================ */
/* ================================================================================ */


/**
  * @brief Inter-integrated circuit (I2C)
  */

typedef struct
{                                                   /*!< I2C Structure                                                         */
  __IO uint32_t  CTRL1;                             /*!< Control register 1                                                    */
  __IO uint32_t  CTRL2;                             /*!< Control register 2                                                    */
  __IO uint32_t  OADDR1;                            /*!< Own address register 1                                                */
  __IO uint32_t  OADDR2;                            /*!< Own address register 2                                                */
  __IO uint32_t  CLKCTRL;                           /*!< Clock contorl register                                                */
  __IO uint32_t  TIMEOUT;                           /*!< Timeout register                                                      */
  __IO uint32_t  STS;                               /*!< Interrupt and Status register                                         */
  __IO uint32_t  CLR;                               /*!< Interrupt clear register                                              */
  __IO uint32_t  PEC;                               /*!< PEC register                                                          */
  __IO uint32_t  RXDT;                              /*!< Receive data register                                                 */
  __IO uint32_t  TXDT;                              /*!< Transmit data register                                                */
} I2C_TypeDef;


/* ================================================================================ */
/* ================                       PWC                      ================ */
/* ================================================================================ */


/**
  * @brief Power control (PWC)
  */

typedef struct
{                                                   /*!< PWC Structure                                                         */
  __IO uint32_t  CTRL;                              /*!< Power control register (PWC_CTRL)                                     */
  __IO uint32_t  CTRLSTS;                           /*!< Power control and status register (PWC_CTRLSTS)                       */
  __IO uint32_t  RESERVED0[2];
  __IO uint32_t  LDOOV;                             /*!< LDO output voltage register                                           */
} PWC_TypeDef;


/* ================================================================================ */
/* ================                      QSPI                     ================ */
/* ================================================================================ */


/**
  * @brief Quad SPI Controller (QSPI)
  */

typedef struct
{                                                   /*!< QSPI Structure                                                       */
  __IO uint32_t  CMD_W0;                            /*!< Command word 0                                                        */
  __IO uint32_t  CMD_W1;                            /*!< Command word 1                                                        */
  __IO uint32_t  CMD_W2;                            /*!< Command word 2                                                        */
  __IO uint32_t  CMD_W3;                            /*!< Command word 3                                                        */
  __IO uint32_t  CTRL;                              /*!< Control register                                                      */
  __IO uint32_t  RESERVED0;
  __IO uint32_t  FIFOSTS;                           /*!< FIFO Status register                                                  */
  __IO uint32_t  RESERVED1;
  __IO uint32_t  CTRL2;                             /*!< control register 2                                                    */
  __IO uint32_t  CMDSTS;                            /*!< CMD status register                                                   */
  __IO uint32_t  RSTS;                              /*!< SPI read status register                                              */
  __IO uint32_t  FSIZE;                             /*!< SPI flash size                                                        */
  __IO uint32_t  XIP_CMD_W0;                        /*!< XIP command word 0                                                    */
  __IO uint32_t  XIP_CMD_W1;                        /*!< XIP command word 1                                                    */
  __IO uint32_t  XIP_CMD_W2;                        /*!< XIP command word 2                                                    */
  __IO uint32_t  XIP_CMD_W3;                        /*!< XIP command word 3                                                    */
  __IO uint32_t  CTRL3;                             /*!< control register 3                                                    */
  __IO uint32_t  RESERVED2[3];
  __IO uint32_t  REV;                               /*!< Revision                                                              */
  __IO uint32_t  RESERVED3[43];
  __IO uint32_t  DT;                                /*!< 32/16/8 bit data port register                                        */
} QSPI1_TypeDef;


/* ================================================================================ */
/* ================                      SCFG                      ================ */
/* ================================================================================ */


/**
  * @brief System configuration controller (SCFG)
  */

typedef struct
{                                                   /*!< SCFG Structure                                                        */
  __IO uint32_t  CFG1;                              /*!< configuration register 1                                              */
  __IO uint32_t  CFG2;                              /*!< configuration register 2                                              */
  __IO uint32_t  EXINTC[4];                         /*!< external interrupt configuration register 1,2,3,4                     */
  __IO uint32_t  RESERVED0[5];
  __IO uint32_t  UHDRV;                             /*!< Ultra high drive register                                             */
} SCFG_TypeDef;


/* ================================================================================ */
/* ================                      SPI                       ================ */
/* ================================================================================ */


/**
  * @brief Serial peripheral interface (SPI)
  */

typedef struct
{                                                   /*!< SPI Structure                                                         */
  __IO uint32_t  CTRL1;                             /*!< control register 1                                                    */
  __IO uint32_t  CTRL2;                             /*!< control register 2                                                    */
  __IO uint32_t  STS;                               /*!< status register                                                       */
  __IO uint32_t  DT;                                /*!< data register                                                         */
  __IO uint32_t  CPOLY;                             /*!< CRC polynomial register                                               */
  __IO uint32_t  RCRC;                              /*!< Receive CRC register                                                  */
  __IO uint32_t  TCRC;                              /*!< Transmit CRC register                                                 */
  __IO uint32_t  I2SCTRL;                           /*!< I2S control register                                                  */
  __IO uint32_t  I2SCLK;                            /*!< I2S clock register                                                    */
  __IO uint32_t  RESERVED1[3];
  __IO uint32_t  MISC1;                             /*!< I2S additional register                                               */
} SPI_TypeDef;


/* ================================================================================ */
/* ================                      TMR                      ================ */
/* ================================================================================ */


/**
  * @brief timer (TMR)
  */

