ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405xx/at32f402_405xx.h
typedef struct
{                                                   /*!< TMR Structure                                                         */
  __IO uint32_t  CTRL1;                             /*!< Control register 1                                                    */
  __IO uint32_t  CTRL2;                             /*!< Control register 2                                                    */
  __IO uint32_t  STCTRL;                            /*!< Subordinate TMR control register                                      */
  __IO uint32_t  IDEN;                              /*!< Interrupt/DMA enable register                                         */
  __IO uint32_t  ISTS;                              /*!< Interrupt status register                                             */
  __IO uint32_t  SWEVT;                             /*!< Software event register                                               */
  __IO uint32_t  CM1;                               /*!< Channel mode register 1                                               */
  __IO uint32_t  CM2;                               /*!< Channel mode register 2                                               */
  __IO uint32_t  CCTRL;                             /*!< Channel control register                                              */
  __IO uint32_t  CVAL;                              /*!< Counter value                                                         */
  __IO uint32_t  DIV;                               /*!< Divider value                                                         */
  __IO uint32_t  PR;                                /*!< Period value                                                          */
  __IO uint32_t  RPR;                               /*!< Repetition of period value                                            */
  __IO uint32_t  C1DT;                              /*!< Channel 1 data register                                               */
  __IO uint32_t  C2DT;                              /*!< Channel 2 data register                                               */
  __IO uint32_t  C3DT;                              /*!< Channel 3 data register                                               */
  __IO uint32_t  C4DT;                              /*!< Channel 4 data register                                               */
  __IO uint32_t  BRK;                               /*!< Brake register                                                        */
  __IO uint32_t  DMACTRL;                           /*!< DMA control register                                                  */
  __IO uint32_t  DMADT;                             /*!< DMA data register                                                     */
  __IO uint32_t  RMP;                               /*!< TMR input remap register                                             */
  __IO uint32_t  RESERVED0[7];
  __IO uint32_t  CM3;                               /*!< Channel output mode register                                          */
  __IO uint32_t  C5DT;                              /*!< Channel 5 data register                                               */
} TMR_TypeDef;


/* ================================================================================ */
/* ================                     USART                      ================ */
/* ================================================================================ */


/**
  * @brief Universal synchronous asynchronous receiver transmitter (USART)
  */

typedef struct
{                                                   /*!< USART Structure                                                       */
  __IO uint32_t  STS;                               /*!< Status register                                                       */
  __IO uint32_t  DT;                                /*!< Data register                                                         */
  __IO uint32_t  BAUDR;                             /*!< Baud rate register                                                    */
  __IO uint32_t  CTRL1;                             /*!< Control register 1                                                    */
  __IO uint32_t  CTRL2;                             /*!< Control register 2                                                    */
  __IO uint32_t  CTRL3;                             /*!< Control register 3                                                    */
  __IO uint32_t  GDIV;                              /*!< Guard time and division register                                      */
  __IO uint32_t  RTOV;                              /*!< Receiver time out value register                                      */
  __IO uint32_t  IFC;                               /*!< Interruption flag clear register                                      */
} USART_TypeDef;


/* ================================================================================ */
/* ================                       WDT                      ================ */
/* ================================================================================ */


/**
  * @brief Watchdog (WDT)
  */

typedef struct
{                                                   /*!< WDT Structure                                                         */
  __IO uint32_t  CMD;                               /*!< Command register                                                      */
  __IO uint32_t  DIV;                               /*!< Division register                                                     */
  __IO uint32_t  RLD;                               /*!< Reload register                                                       */
  __IO uint32_t  STS;                               /*!< Status register                                                       */
  __IO uint32_t  WIN;                               /*!< Window register                                                       */
} WDT_TypeDef;



/* ================================================================================ */
/* ================                      WWDT                      ================ */
/* ================================================================================ */


/**
  * @brief Window watchdog (WWDT)
  */

typedef struct
{                                                   /*!< WWDT Structure                                                        */
  __IO uint32_t  CTRL;                              /*!< Control register                                                      */
  __IO uint32_t  CFG;                               /*!< Configuration register                                                */
  __IO uint32_t  STS;                               /*!< Status register                                                       */
} WWDT_TypeDef;


/**
  * @}
  */

/** @addtogroup Peripheral_memory_map
  * @{
  */

#define QSPI2_MEM_BASE                   ((uint32_t)0xB0000000)
#define QSPI2_REG_BASE                   ((uint32_t)0xA0002000)
#define QSPI1_REG_BASE                   ((uint32_t)0xA0001000)
#define QSPI1_MEM_BASE                   ((uint32_t)0x90000000)
#define PERIPH_BASE                      ((uint32_t)0x40000000)
#define SRAM_BB_BASE                     ((uint32_t)0x22000000)
#define PERIPH_BB_BASE                   ((uint32_t)0x42000000)
#define SRAM_BASE                        ((uint32_t)0x20000000)
#define USD_BASE                         ((uint32_t)0x1FFFF800)
#define FLASH_BASE                       ((uint32_t)0x08000000)

#define DEBUG_BASE                       ((uint32_t)0xE0042000)

#define APB1PERIPH_BASE                  (PERIPH_BASE)
#define APB2PERIPH_BASE                  (PERIPH_BASE + 0x10000)
#define AHBPERIPH1_BASE                  (PERIPH_BASE + 0x20000)
#define AHBPERIPH2_BASE                  (PERIPH_BASE + 0x10000000)

/* apb1 bus base address */
#define UART8_BASE                       (APB1PERIPH_BASE + 0x7C00)
#define UART7_BASE                       (APB1PERIPH_BASE + 0x7800)
#define PWC_BASE                         (APB1PERIPH_BASE + 0x7000)
#define CAN1_BASE                        (APB1PERIPH_BASE + 0x6400)
#define I2C3_BASE                        (APB1PERIPH_BASE + 0x5C00)
#define I2C2_BASE                        (APB1PERIPH_BASE + 0x5800)
#define I2C1_BASE                        (APB1PERIPH_BASE + 0x5400)
#define USART5_BASE                      (APB1PERIPH_BASE + 0x5000)
#define USART4_BASE                      (APB1PERIPH_BASE + 0x4C00)
#define USART3_BASE                      (APB1PERIPH_BASE + 0x4800)
#define USART2_BASE                      (APB1PERIPH_BASE + 0x4400)
#define SPI3_BASE                        (APB1PERIPH_BASE + 0x3C00)
#define SPI2_BASE                        (APB1PERIPH_BASE + 0x3800)
#define WDT_BASE                         (APB1PERIPH_BASE + 0x3000)
#define WWDT_BASE                        (APB1PERIPH_BASE + 0x2C00)
#define ERTC_BASE                        (APB1PERIPH_BASE + 0x2800)
#define TMR14_BASE                       (APB1PERIPH_BASE + 0x2000)
#define TMR13_BASE                       (APB1PERIPH_BASE + 0x1C00)
#define TMR7_BASE                        (APB1PERIPH_BASE + 0x1400)
#define TMR6_BASE                        (APB1PERIPH_BASE + 0x1000)
#define TMR4_BASE                        (APB1PERIPH_BASE + 0x0800)
#define TMR3_BASE                        (APB1PERIPH_BASE + 0x0400)
#define TMR2_BASE                        (APB1PERIPH_BASE + 0x0000)
/* apb2 bus base address */
#define OTGHS_PHY_BASE                   (APB2PERIPH_BASE + 0x7C00)
#define ACC_BASE                         (APB2PERIPH_BASE + 0x7400)
#define I2SF5_BASE                       (APB2PERIPH_BASE + 0x5000)
#define TMR11_BASE                       (APB2PERIPH_BASE + 0x4800)
#define TMR10_BASE                       (APB2PERIPH_BASE + 0x4400)
#define TMR9_BASE                        (APB2PERIPH_BASE + 0x4000)
#define EXINT_BASE                       (APB2PERIPH_BASE + 0x3C00)
#define SCFG_BASE                        (APB2PERIPH_BASE + 0x3800)
#define SPI1_BASE                        (APB2PERIPH_BASE + 0x3000)
#define ADC1_BASE                        (APB2PERIPH_BASE + 0x2000)
#define ADCCOM_BASE                      (APB2PERIPH_BASE + 0x2300)
#define USART6_BASE                      (APB2PERIPH_BASE + 0x1400)
#define USART1_BASE                      (APB2PERIPH_BASE + 0x1000)
#define TMR1_BASE                        (APB2PERIPH_BASE + 0x0000)
/* ahb bus base address */
#define GPIOF_BASE                       (AHBPERIPH1_BASE + 0x1400)
#define GPIOD_BASE                       (AHBPERIPH1_BASE + 0x0C00)
#define GPIOC_BASE                       (AHBPERIPH1_BASE + 0x0800)
#define GPIOB_BASE                       (AHBPERIPH1_BASE + 0x0400)
#define GPIOA_BASE                       (AHBPERIPH1_BASE + 0x0000)

