ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405xx/at32f402_405xx.h
/******************  Bit definition for ADC_STS register  ***************/
#define ADC_STS_VMOR                     (0x1U << 0)
#define ADC_STS_OCCC                     (0x1U << 1)
#define ADC_STS_CCE                      (0x1U << 1)
#define ADC_STS_PCCE                     (0x1U << 2)
#define ADC_STS_PCCS                     (0x1U << 3)
#define ADC_STS_OCCS                     (0x1U << 4)

/******************  Bit definition for ADC_CTRL1 register  ***************/
#define ADC_CTRL1_CCEIEN                 (0x1U << 5)
#define ADC_CTRL1_VMORIEN                (0x1U << 6)
#define ADC_CTRL1_PCCEIEN                (0x1U << 7)
#define ADC_CTRL1_SQEN                   (0x1U << 8)
#define ADC_CTRL1_VMSGEN                 (0x1U << 9)
#define ADC_CTRL1_PCAUTOEN               (0x1U << 10)
#define ADC_CTRL1_OCPEN                  (0x1U << 11)
#define ADC_CTRL1_PCPEN                  (0x1U << 12)
#define ADC_CTRL1_PCVMEN                 (0x1U << 22)
#define ADC_CTRL1_OCVMEN                 (0x1U << 23)
#define ADC_CTRL1_OCCOIE                 (0x1U << 26)

/******************  Bit definition for ADC_CTRL2 register  *******************/
#define ADC_CTRL2_ADCEN                  (0x1U << 0)
#define ADC_CTRL2_RPEN                   (0x1U << 1)
#define ADC_CTRL2_ADCAL                  (0x1U << 2)
#define ADC_CTRL2_ADCALINIT              (0x1U << 3)
#define ADC_CTRL2_OCDMAEN                (0x1U << 8)
#define ADC_CTRL2_DTALIGN                (0x1U << 11)
#define ADC_CTRL2_DTALIGN_R              (0x0U << 11)
#define ADC_CTRL2_DTALIGN_L              (0x1U << 11)
#define ADC_CTRL2_PCTEN                  (0x1U << 15)
#define ADC_CTRL2_OCTEN                  (0x1U << 20)
#define ADC_CTRL2_PCSWTRG                (0x1U << 21)
#define ADC_CTRL2_OCSWTRG                (0x1U << 22)
#define ADC_CTRL2_ITSRVEN                (0x1U << 23)

/******************  Bit definition for ADC_VMHB register  ***************/
#define ADC_VMHB_HB                      (0xFFFFU << 0)

/******************  Bit definition for ADC_VMLB register  ***************/
#define ADC_VMLB_LB                      (0x0000U << 0)


/* =========================================================================================================================== */
/* ================                                           CRM                                             ================ */
/* =========================================================================================================================== */
/******************  Bit definition for CRM_CTRL register  *****************/
#define CRM_CTRL_HICKEN                  (0x1U << 0)
#define CRM_CTRL_HICKSTBL                (0x1U << 1)
#define CRM_CTRL_HICKTRIM                (0x3FU << 2)
#define CRM_CTRL_HEXTEN                  (0x1U << 16)
#define CRM_CTRL_HEXTSTBL                (0x1U << 17)
#define CRM_CTRL_HEXTBYPS                (0x1U << 18)
#define CRM_CTRL_CFDEN                   (0x1U << 19)
#define CRM_CTRL_PLLEN                   (0x1U << 24)
#define CRM_CTRL_PLLSTBL                 (0x1U << 25)
#define CRM_CTRL_PLLUSTBL                (0x1U << 26)

/******************  Bit definition for CRM_PLLCFG register  *****************/
#define CRM_PLLCFG_PLLUEN                (0x1U << 29)
#define CRM_PLLCFG_PLLRCS                (0x1U << 30)

/******************  Bit definition for CRM_CFG register  ******************/
#define CRM_CFG_SCLKSEL                  (0x3U << 0)
#define CRM_CFG_SCLK_HICK                (0x0U << 0)
#define CRM_CFG_SCLK_HEXT                (0x1U << 0)
#define CRM_CFG_SCLK_PLL                 (0x2U << 0)
#define CRM_CFG_SCLKSTS                  (0x3U << 2)
#define CRM_CFG_SCLKSTS_HICK             (0x0U << 2)
#define CRM_CFG_SCLKSTS_HEXT             (0x1U << 2)
#define CRM_CFG_SCLKSTS_PLL              (0x2U << 2)

/*****************  Bit definition for CRM_AHBRST1 register  ***************/
#define CRM_AHBRST1_GPIOARST             (0x1U << 0)
#define CRM_AHBRST1_GPIOBRST             (0x1U << 1)
#define CRM_AHBRST1_GPIOCRST             (0x1U << 2)
#define CRM_AHBRST1_GPIODRST             (0x1U << 3)
#define CRM_AHBRST1_GPIOFRST             (0x1U << 5)
#define CRM_AHBRST1_CRCRST               (0x1U << 12)
#define CRM_AHBRST1_DMA1RST              (0x1U << 22)
#define CRM_AHBRST1_DMA2RST              (0x1U << 24)
#define CRM_AHBRST1_OTGHSRST             (0x1U << 29)

/*****************  Bit definition for CRM_AHBRST2 register  ***************/
#define CRM_AHBRST2_OTGFS1RST            (0x1U << 7)

/*****************  Bit definition for CRM_AHBRST3 register  ***************/
#define CRM_AHBRST3_QSPI1RST             (0x1U << 1)

/*****************  Bit definition for CRM_APB1RST register  ***************/
#define CRM_APB1RST_TMR2RST              (0x1U << 0)
#define CRM_APB1RST_TMR3RST              (0x1U << 1)
#define CRM_APB1RST_TMR4RST              (0x1U << 2)
#define CRM_APB1RST_TMR6RST              (0x1U << 4)
#define CRM_APB1RST_TMR7RST              (0x1U << 5)
#define CRM_APB1RST_TMR13RST             (0x1U << 7)
#define CRM_APB1RST_TMR14RST             (0x1U << 8)
#define CRM_APB1RST_WWDTRST              (0x1U << 11)
#define CRM_APB1RST_SPI2RST              (0x1U << 14)
#define CRM_APB1RST_SPI3RST              (0x1U << 15)
#define CRM_APB1RST_USART2RST            (0x1U << 17)
#define CRM_APB1RST_USART3RST            (0x1U << 18)
#define CRM_APB1RST_USART4RST            (0x1U << 19)
#define CRM_APB1RST_USART5RST            (0x1U << 20)
#define CRM_APB1RST_I2C1RST              (0x1U << 21)
#define CRM_APB1RST_I2C2RST              (0x1U << 22)
#define CRM_APB1RST_I2C3RST              (0x1U << 23)
#define CRM_APB1RST_CAN1RST              (0x1U << 25)
#define CRM_APB1RST_PWCRST               (0x1U << 28)
#define CRM_APB1RST_UART7RST             (0x1U << 30)
#define CRM_APB1RST_UART8RST             (0x1U << 31)

/*****************  Bit definition for CRM_APB2RST register  ***************/
#define CRM_APB2RST_TMR1RST              (0x1U << 0)
#define CRM_APB2RST_USART1RST            (0x1U << 4)
#define CRM_APB2RST_USART6RST            (0x1U << 5)
#define CRM_APB2RST_ADC1RST              (0x1U << 8)
#define CRM_APB2RST_SPI1RST              (0x1U << 12)
#define CRM_APB2RST_SCFGRST              (0x1U << 14)
#define CRM_APB2RST_TMR9RST              (0x1U << 16)
#define CRM_APB2RST_TMR10RST             (0x1U << 17)
#define CRM_APB2RST_TMR11RST             (0x1U << 18)
#define CRM_APB2RST_I2SF5RST             (0x1U << 20)
#define CRM_APB2RST_ACCRST               (0x1U << 29)

/*****************  Bit definition for CRM_AHBEN1 register  ***************/
#define CRM_AHBEN1_GPIOAEN               (0x1U << 0)
#define CRM_AHBEN1_GPIOBEN               (0x1U << 1)
#define CRM_AHBEN1_GPIOCEN               (0x1U << 2)
#define CRM_AHBEN1_GPIODEN               (0x1U << 3)
#define CRM_AHBEN1_GPIOFEN               (0x1U << 5)
#define CRM_AHBEN1_CRCEN                 (0x1U << 12)
#define CRM_AHBEN1_DMA1EN                (0x1U << 22)
#define CRM_AHBEN1_DMA2EN                (0x1U << 24)
#define CRM_AHBEN1_OTGHSEN               (0x1U << 29)

/*****************  Bit definition for CRM_AHBEN2 register  ***************/
#define CRM_AHBEN2_OTGFS1EN              (0x1U << 7)

/*****************  Bit definition for CRM_AHBEN3 register  ***************/
#define CRM_AHBEN3_QSPI1EN               (0x1U << 1)

/*****************  Bit definition for CRM_APB1EN register  ***************/
#define CRM_APB1EN_TMR2EN                (0x1U << 0)
#define CRM_APB1EN_TMR3EN                (0x1U << 1)
#define CRM_APB1EN_TMR4EN                (0x1U << 2)
#define CRM_APB1EN_TMR6EN                (0x1U << 4)
#define CRM_APB1EN_TMR7EN                (0x1U << 5)
#define CRM_APB1EN_TMR13EN               (0x1U << 7)
#define CRM_APB1EN_TMR14EN               (0x1U << 8)
#define CRM_APB1EN_WWDTEN                (0x1U << 11)
#define CRM_APB1EN_SPI2EN                (0x1U << 14)
#define CRM_APB1EN_SPI3EN                (0x1U << 15)
#define CRM_APB1EN_USART2EN              (0x1U << 17)
#define CRM_APB1EN_USART3EN              (0x1U << 18)
#define CRM_APB1EN_USART4EN              (0x1U << 19)
#define CRM_APB1EN_USART5EN              (0x1U << 20)
#define CRM_APB1EN_I2C1EN                (0x1U << 21)
#define CRM_APB1EN_I2C2EN                (0x1U << 22)
#define CRM_APB1EN_I2C3EN                (0x1U << 23)
#define CRM_APB1EN_CAN1EN                (0x1U << 25)
#define CRM_APB1EN_PWCEN                 (0x1U << 28)
#define CRM_APB1EN_UART7EN               (0x1U << 30)
#define CRM_APB1EN_UART8EN               (0x1U << 31)

/*****************  Bit definition for CRM_APB2EN register  ***************/
#define CRM_APB2EN_TMR1EN                (0x1U << 0)
#define CRM_APB2EN_USART1EN              (0x1U << 4)
#define CRM_APB2EN_USART6EN              (0x1U << 5)
#define CRM_APB2EN_ADC1EN                (0x1U << 8)
#define CRM_APB2EN_SPI1EN                (0x1U << 12)
#define CRM_APB2EN_SCFGEN                (0x1U << 14)
#define CRM_APB2EN_TMR9EN                (0x1U << 16)
#define CRM_APB2EN_TMR10EN               (0x1U << 17)
#define CRM_APB2EN_TMR11EN               (0x1U << 18)
#define CRM_APB2EN_I2SF5EN               (0x1U << 20)
#define CRM_APB2EN_ACCEN                 (0x1U << 29)

/*****************  Bit definition for CRM_AHBLPEN1 register  ***************/
#define CRM_AHBLPEN1_GPIOALPEN           (0x1U << 0)
#define CRM_AHBLPEN1_GPIOBLPEN           (0x1U << 1)
#define CRM_AHBLPEN1_GPIOCLPEN           (0x1U << 2)
#define CRM_AHBLPEN1_GPIODLPEN           (0x1U << 3)
#define CRM_AHBLPEN1_GPIOFLPEN           (0x1U << 5)
#define CRM_AHBLPEN1_CRCLPEN             (0x1U << 12)
#define CRM_AHBLPEN1_DMA1LPEN            (0x1U << 22)
#define CRM_AHBLPEN1_DMA2LPEN            (0x1U << 24)
#define CRM_AHBLPEN1_OTGHSLPEN           (0x1U << 29)

