ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405xx/at32f402_405xx.h
/*****************  Bit definition for CRM_AHBLPEN2 register  ***************/
#define CRM_AHBLPEN2_OTGFS1LPEN          (0x1U << 7)

/*****************  Bit definition for CRM_AHBLPEN3 register  ***************/
#define CRM_AHBLPEN3_QSPI1LPEN           (0x1U << 1)

/*****************  Bit definition for CRM_APB1LPEN register  ***************/
#define CRM_APB1LPEN_TMR2LPEN            (0x1U << 0)
#define CRM_APB1LPEN_TMR3LPEN            (0x1U << 1)
#define CRM_APB1LPEN_TMR4LPEN            (0x1U << 2)
#define CRM_APB1LPEN_TMR6LPEN            (0x1U << 4)
#define CRM_APB1LPEN_TMR7LPEN            (0x1U << 5)
#define CRM_APB1LPEN_TMR13LPEN           (0x1U << 7)
#define CRM_APB1LPEN_TMR14LPEN           (0x1U << 8)
#define CRM_APB1LPEN_WWDTLPEN            (0x1U << 11)
#define CRM_APB1LPEN_SPI2LPEN            (0x1U << 14)
#define CRM_APB1LPEN_SPI3LPEN            (0x1U << 15)
#define CRM_APB1LPEN_USART2LPEN          (0x1U << 17)
#define CRM_APB1LPEN_USART3LPEN          (0x1U << 18)
#define CRM_APB1LPEN_USART4LPEN          (0x1U << 19)
#define CRM_APB1LPEN_USART5LPEN          (0x1U << 20)
#define CRM_APB1LPEN_I2C1LPEN            (0x1U << 21)
#define CRM_APB1LPEN_I2C2LPEN            (0x1U << 22)
#define CRM_APB1LPEN_I2C3LPEN            (0x1U << 23)
#define CRM_APB1LPEN_CAN1LPEN            (0x1U << 25)
#define CRM_APB1LPEN_PWCLPEN             (0x1U << 28)
#define CRM_APB1LPEN_UART7LPEN           (0x1U << 30)
#define CRM_APB1LPEN_UART8LPEN           (0x1U << 31)

/*****************  Bit definition for CRM_APB2LPEN register  ***************/
#define CRM_APB2LPEN_TMR1LPEN            (0x1U << 0)
#define CRM_APB2LPEN_USART1LPEN          (0x1U << 4)
#define CRM_APB2LPEN_USART6LPEN          (0x1U << 5)
#define CRM_APB2LPEN_ADC1LPEN            (0x1U << 8)
#define CRM_APB2LPEN_SPI1LPEN            (0x1U << 12)
#define CRM_APB2LPEN_SCFGLPEN            (0x1U << 14)
#define CRM_APB2LPEN_TMR9LPEN            (0x1U << 16)
#define CRM_APB2LPEN_TMR10LPEN           (0x1U << 17)
#define CRM_APB2LPEN_TMR11LPEN           (0x1U << 18)
#define CRM_APB2LPEN_I2SF5LPEN           (0x1U << 20)
#define CRM_APB2LPEN_ACCLPEN             (0x1U << 29)

/******************  Bit definition for CRM_BPDC register  *****************/
#define CRM_BPDC_LEXTEN                  (0x1U << 0)
#define CRM_BPDC_LEXTSTBL                (0x1U << 1)
#define CRM_BPDC_LEXTBYPS                (0x1U << 2)
#define CRM_BPDC_ERTCSEL                 (0x3U << 8)
#define CRM_BPDC_ERTCSEL_LEXT            (0x1U << 8)
#define CRM_BPDC_ERTCSEL_LICK            (0x2U << 8)
#define CRM_BPDC_ERTCSEL_HEXTDIV         (0x3U << 8)
#define CRM_BPDC_ERTCEN                  (0x1U << 15)
#define CRM_BPDC_BPDRST                  (0x1U << 16)

/******************  Bit definition for CRM_CTRLSTS register  **************/
#define CRM_CTRLSTS_LICKEN               (0x1U << 0)
#define CRM_CTRLSTS_LICKSTBL             (0x1U << 1)
#define CRM_CTRLSTS_RSTFC                (0x1U << 24)
#define CRM_CTRLSTS_NRSTF                (0x1U << 26)
#define CRM_CTRLSTS_PORRSTF              (0x1U << 27)
#define CRM_CTRLSTS_SWRSTF               (0x1U << 28)
#define CRM_CTRLSTS_WDTRSTF              (0x1U << 29)
#define CRM_CTRLSTS_WWDTRSTF             (0x1U << 30)
#define CRM_CTRLSTS_LPRSTF               (0x1U << 31)

/******************  Bit definition for CRM_OTGHS register  ****************/
#define CRM_OTGHS_USBHS_PHY12_SEL        (0x1U << 4)
#define CRM_OTGHS_USBHS_PHY12_SEL_HEXT   (0x0U << 4)

/******************  Bit definition for CRM_MISC1 register  ****************/
#define CRM_MISC1_HICKDIV                (0x1U << 12)
#define CRM_MISC1_HICK_TO_SCLK           (0x1U << 14)

/******************  Bit definition for CRM_MISC2 register  ****************/
#define CRM_MISC2_AUTO_STEP_EN           (0x3U << 4)
#define CRM_MISC2_PLLU_USB48_SEL         (0x1U << 10)
#define CRM_MISC2_PLLU_USB48_SEL_PLLU    (0x0U << 10)
#define CRM_MISC2_PLLU_USB48_SEL_HICK    (0x1U << 10)


/* =========================================================================================================================== */
/* ================                                           ERTC                                             ================ */
/* =========================================================================================================================== */

/******************  Bit definition for ERTC_TIME register  *******************/
/*!< SU configuration */
#define ERTC_TIME_SU_Pos                 (0U)
#define ERTC_TIME_SU_Msk                 (0xFU << ERTC_TIME_SU_Pos)              /*!< 0x0000000F */
#define ERTC_TIME_SU                     ERTC_TIME_SU_Msk                        /*!< SU[3:0] (Second units) */
#define ERTC_TIME_SU_0                   (0x1U << ERTC_TIME_SU_Pos)              /*!< 0x00000001 */
#define ERTC_TIME_SU_1                   (0x2U << ERTC_TIME_SU_Pos)              /*!< 0x00000002 */
#define ERTC_TIME_SU_2                   (0x4U << ERTC_TIME_SU_Pos)              /*!< 0x00000004 */
#define ERTC_TIME_SU_3                   (0x8U << ERTC_TIME_SU_Pos)              /*!< 0x00000008 */

/*!< ST configuration */
#define ERTC_TIME_ST_Pos                 (4U)
#define ERTC_TIME_ST_Msk                 (0x7U << ERTC_TIME_ST_Pos)              /*!< 0x00000070 */
#define ERTC_TIME_ST                     ERTC_TIME_ST_Msk                        /*!< ST[2:0] (Second tens) */
#define ERTC_TIME_ST_0                   (0x1U << ERTC_TIME_ST_Pos)              /*!< 0x00000010 */
#define ERTC_TIME_ST_1                   (0x2U << ERTC_TIME_ST_Pos)              /*!< 0x00000020 */
#define ERTC_TIME_ST_2                   (0x4U << ERTC_TIME_ST_Pos)              /*!< 0x00000040 */

/*!< MU configuration */
#define ERTC_TIME_MU_Pos                 (8U)
#define ERTC_TIME_MU_Msk                 (0xFU << ERTC_TIME_MU_Pos)              /*!< 0x00000F00 */
#define ERTC_TIME_MU                     ERTC_TIME_MU_Msk                        /*!< MU[3:0] (Minute units) */
#define ERTC_TIME_MU_0                   (0x1U << ERTC_TIME_MU_Pos)              /*!< 0x00000100 */
#define ERTC_TIME_MU_1                   (0x2U << ERTC_TIME_MU_Pos)              /*!< 0x00000200 */
#define ERTC_TIME_MU_2                   (0x4U << ERTC_TIME_MU_Pos)              /*!< 0x00000400 */
#define ERTC_TIME_MU_3                   (0x8U << ERTC_TIME_MU_Pos)              /*!< 0x00000800 */

