ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405xx/at32f402_405xx.h
/******************  Bit definition for FLASH_CTRL register  ***************/
#define FLASH_CTRL_FPRGM                 (0x1U << 0)
#define FLASH_CTRL_SECERS                (0x1U << 1)
#define FLASH_CTRL_BANKERS               (0x1U << 2)
#define FLASH_CTRL_USDPRGM               (0x1U << 4)
#define FLASH_CTRL_USDERS                (0x1U << 5)
#define FLASH_CTRL_ERSTR                 (0x1U << 6)
#define FLASH_CTRL_OPLK                  (0x1U << 7)


/* =========================================================================================================================== */
/* ================                                           TMR                                             ================ */
/* =========================================================================================================================== */
/******************  Bit definition for TMR_IDEN register  ****************/
#define TMR_IDEN_OVFIEN                  (0x1U << 0)
#define TMR_IDEN_C1IEN                   (0x1U << 1)
#define TMR_IDEN_C2IEN                   (0x1U << 2)
#define TMR_IDEN_C3IEN                   (0x1U << 3)
#define TMR_IDEN_C4IEN                   (0x1U << 4)
#define TMR_IDEN_HALLIEN                 (0x1U << 5)
#define TMR_IDEN_TIEN                    (0x1U << 6)
#define TMR_IDEN_BRKIEN                  (0x1U << 7)
#define TMR_IDEN_OVFDEN                  (0x1U << 8)
#define TMR_IDEN_C1DEN                   (0x1U << 9)
#define TMR_IDEN_C2DEN                   (0x1U << 10)
#define TMR_IDEN_C3DEN                   (0x1U << 11)
#define TMR_IDEN_C4DEN                   (0x1U << 12)
#define TMR_IDEN_HALLDEN                 (0x1U << 13)
#define TMR_IDEN_TDEN                    (0x1U << 14)


/* =========================================================================================================================== */
/* ================                                           DMA                                             ================ */
/* =========================================================================================================================== */
/******************  Bit definition for DMA_CxCTRL register  **************/
#define DMA_CTRL_CHEN                    (0x1U << 0)
#define DMA_CTRL_FDTIEN                  (0x1U << 1)
#define DMA_CTRL_HDTIEN                  (0x1U << 2)
#define DMA_CTRL_DTERRIEN                (0x1U << 3)
#define DMA_CTRL_DTD                     (0x1U << 4)
#define DMA_CTRL_LM                      (0x1U << 5)
#define DMA_CTRL_PINCM                   (0x1U << 6)
#define DMA_CTRL_MINCM                   (0x1U << 7)
#define DMA_CTRL_PWIDTH                  (0x3U << 8)
#define DMA_CTRL_PWIDTH_8BITS            (0x0U << 8)
#define DMA_CTRL_PWIDTH_16BITS           (0x1U << 8)
#define DMA_CTRL_PWIDTH_32BITS           (0x2U << 8)
#define DMA_CTRL_MWIDTH                  (0x3U << 10)
#define DMA_CTRL_MWIDTH_8BITS            (0x0U << 10)
#define DMA_CTRL_MWIDTH_16BITS           (0x1U << 10)
#define DMA_CTRL_MWIDTH_32BITS           (0x2U << 10)
#define DMA_CTRL_CHPL                    (0x3U << 12)
#define DMA_CTRL_CHPL_LOW                (0x0U << 12)
#define DMA_CTRL_CHPL_MID                (0x1U << 12)
#define DMA_CTRL_CHPL_HIGH               (0x2U << 12)
#define DMA_CTRL_CHPL_HIGHEST            (0x3U << 12)
#define DMA_CTRL_M2M                     (0x1U << 14)

/******************  Bit definition for DMA_MUXSEL register  *************/
#define DMA_MUXSEL_TBL_SEL               (0x1U << 0)

/******************  Bit definition for DMA_MUXCxCTRL register  *************/
#define DMA_MUXCTRL_SYNCOVIEN            (0x1U << 8)
#define DMA_MUXCTRL_EVTGEN               (0x1U << 9)
#define DMA_MUXCTRL_SYNCEN               (0x1U << 16)
#define DMA_MUXCTRL_SYNCPOL              (0x3U << 17)
#define DMA_MUXCTRL_SYNCPOL_NONE         (0x0U << 17)
#define DMA_MUXCTRL_SYNCPOL_RISING       (0x1U << 17)
#define DMA_MUXCTRL_SYNCPOL_FALLING      (0x2U << 17)
#define DMA_MUXCTRL_SYNCPOL_BOTH         (0x3U << 17)

/******************  Bit definition for DMA_MUXGxCTRL register  *************/
#define DMA_MUXGCTRL_TRGOVIEN            (0x1U << 8)
#define DMA_MUXGCTRL_GEN                 (0x1U << 16)
#define DMA_MUXGCTRL_GPOL                (0x3U << 17)
#define DMA_MUXGCTRL_GPOL_NONE           (0x0U << 17)
#define DMA_MUXGCTRL_GPOL_RISING         (0x1U << 17)
#define DMA_MUXGCTRL_GPOL_FALLING        (0x2U << 17)
#define DMA_MUXGCTRL_GPOL_BOTH           (0x3U << 17)


/* =========================================================================================================================== */
/* ================                                           I2C                                             ================ */
/* =========================================================================================================================== */
/******************  Bit definition for I2C_CTRL1 register  ***************/
#define I2C_CTRL1_I2CEN                  (0x1U << 0)
#define I2C_CTRL1_TDIEN                  (0x1U << 1)
#define I2C_CTRL1_RDIEN                  (0x1U << 2)
#define I2C_CTRL1_ADDRIEN                (0x1U << 3)
#define I2C_CTRL1_ACKFAILIEN             (0x1U << 4)
#define I2C_CTRL1_STOPIEN                (0x1U << 5)
#define I2C_CTRL1_TDCIEN                 (0x1U << 6)
#define I2C_CTRL1_ERRIEN                 (0x1U << 7)
#define I2C_CTRL1_DMATEN                 (0x1U << 14)
#define I2C_CTRL1_DMAREN                 (0x1U << 15)
#define I2C_CTRL1_SCTRL                  (0x1U << 16)
#define I2C_CTRL1_STRETCH                (0x1U << 17)
#define I2C_CTRL1_GCAEN                  (0x1U << 19)
#define I2C_CTRL1_HADDREN                (0x1U << 20)
#define I2C_CTRL1_DEVADDREN              (0x1U << 21)
#define I2C_CTRL1_SMBALERT               (0x1U << 22)
#define I2C_CTRL1_PECEN                  (0x1U << 23)

/******************  Bit definition for I2C_CTRL2 register  ***************/
#define I2C_CTRL2_DIR                    (0x1U << 10)
#define I2C_CTRL2_ADDR10                 (0x1U << 11)
#define I2C_CTRL2_READH10                (0x1U << 12)
#define I2C_CTRL2_GENSTART               (0x1U << 13)
#define I2C_CTRL2_GENSTOP                (0x1U << 14)
#define I2C_CTRL2_NACKEN                 (0x1U << 15)
#define I2C_CTRL2_RLDEN                  (0x1U << 24)
#define I2C_CTRL2_ASTOPEN                (0x1U << 25)
#define I2C_CTRL2_PECTEN                 (0x1U << 26)
#define I2C_CTRL2_CNT_MASK               (0xFF << 16)

